import { Component, OnInit } from '@angular/core';
import { CommonModule } from '@angular/common';
import { FoodforthoughtComponent } from 'src/app/common/foodforthought/foodforthought.component';

@Component({
  selector: 'app-accountingarabicfoodforthought',
  standalone: true,
  imports: [CommonModule,FoodforthoughtComponent],
  templateUrl: './accountingarabicfoodforthought.component.html',
  styleUrls: ['./accountingarabicfoodforthought.component.scss']
})
export class AccountingArabicfoodforthoughtComponent implements OnInit {

  gamename = 'accountingarabic';

  questionanswerpaper: any = [
    {
      feedbackvalue: '',
      feedback: ['لا يؤثر إصدار أسهم عادية إضافية عادةً على إجمالي الالتزامات، بل إنه يؤدي بدلاً من ذلك إلى زيادة إجمالي حقوق الملكية.',
        'لا يؤثر إصدار أسهم عادية إضافية بشكل مباشر على إجمالي الأصول.',
        'صحيح! إن إصدار أسهم عادية إضافية يزيد من إجمالي حقوق الملكية في الشركة حيث يمثل ملكية إضافية في العمل.'],
      question: ['عندما تصدر الشركة أسهمًا عادية إضافية، كيف يؤثر ذلك على الميزانية العمومية؟',],
      option: ['يقلل إجمالي المطلوبات',
        "يزيد إجمالي الأصول",
        "يزيد إجمالي حقوق الملكية"],
      disabled: false,
      questionchecked: [false, false, false],
      cellvalue: ['r7', 'r8', 'r9']
    },
    {
      feedbackvalue: '',
      feedback: ['يؤدي الاعتراف بمصروف الاستهلاك عادةً إلى انخفاض صافي الدخل لأنه يمثل مصروفًا غير نقدي.',
        'لا تؤثر مصاريف الاستهلاك بشكل مباشر على إجمالي الربح، والذي يتم حسابه على أنه الإيرادات مطروحًا منها تكلفة البضائع المباعة.',
        "صحيح! إن الاعتراف بمصروف الاستهلاك يقلل من صافي الدخل لأنه يُطرح من أرباح الشركة."],
      question: [' ما هو تأثير الاعتراف بمصروف الاستهلاك على بيان الدخل؟'],
      option: ['يزيد صافي الدخل',
        "يقل إجمالي الربح",
        "يقل صافي الدخل"],
      disabled: false,
      questionchecked: [false, false, false],
      cellvalue: ['r10', 'r11', 'r12']
    },
    {
      feedbackvalue: '',
      feedback: ['يؤدي اقتراض الأموال من البنك عادةً إلى زيادة التدفق النقدي من التمويل لأنه يمثل تدفقًا نقديًا.',
        "لا يؤثر اقتراض الأموال بشكل مباشر على التدفق النقدي من العمليات، والذي يشمل في المقام الأول النقد الناتج عن الأنشطة التجارية الأساسية للشركة.",
        "صحيح! إن اقتراض الأموال من البنك يزيد من التدفق النقدي من التمويل لأنه يمثل رأس مال جديد تم جمعه."],
      question: [' إذا اقترضت الشركة أموالاً من أحد البنوك، فكيف ينعكس ذلك في بيان التدفق النقدي؟',],
      option: ['يقل التدفق النقدي من التمويل',
        "يزيد التدفق النقدي من العمليات",
        "يزيد التدفق النقدي من التمويل"],
      disabled: false,
      questionchecked: [false, false, false],
      cellvalue: ['r13', 'r14', 'r15']
    },
    {
      feedbackvalue: '',
      feedback: ['صحيح! إن الزيادة في الحسابات المدينة تمثل زيادة في الأصول لأنها تعكس المبالغ المستحقة للشركة من العملاء مقابل السلع أو الخدمات المباعة بالائتمان.',
        "لا تؤثر الحسابات المستحقة القبض بشكل مباشر على إجمالي الالتزامات.",
        "لا تؤثر الحسابات المستحقة على إجمالي حقوق الملكية بشكل مباشر."],
      question: ['س4 كيف يؤثر ارتفاع الحسابات المدينة على الميزانية العمومية؟',],
      option: ['يزيد إجمالي الأصول',
        "يقل إجمالي المطلوبات",
        "يقل إجمالي حقوق الملكية"],
      disabled: false,
      questionchecked: [false, false, false],
      cellvalue: ['r16', 'r17', 'r18']
    },
    {
      feedbackvalue: '',
      feedback: ['صحيح! عادةً ما تؤدي الزيادة في تكلفة السلع المباعة إلى خفض صافي الدخل لأنها تمثل نفقات أعلى يتم تكبدها في إنتاج السلع أو الخدمات.',
        "عادة ما تؤدي الزيادة في تكلفة البضائع المباعة إلى تقليل صافي الدخل.",
        "إن الزيادة في تكلفة البضائع المباعة تؤدي عمومًا إلى انخفاض صافي الدخل."],
      question: ['س5 ماذا يحدث لصافي الدخل إذا زادت تكلفة البضائع المباعة؟'],
      option: ['يقل',
        "يزيد",
        "يبقى دون تغيير"],
      disabled: false,
      questionchecked: [false, false, false],
      cellvalue: ['r19', 'r20', 'r21']
    },
    {
      feedbackvalue: '',
      feedback: ['صحيح! إن دفع الأرباح للمساهمين يقلل من التدفق النقدي من التمويل لأنه يمثل تدفقًا نقديًا خارجيًا.',
        "لا يؤثر دفع الأرباح بشكل مباشر على التدفق النقدي من العمليات، والذي يشمل في المقام الأول النقد الناتج عن الأنشطة التجارية الأساسية للشركة.",
        "لا يؤثر دفع الأرباح بشكل مباشر على التدفق النقدي من الاستثمار، والذي يشمل في المقام الأول التدفقات النقدية المتعلقة بأنشطة الاستثمار مثل شراء أو بيع الأصول."],
      question: ['س6 إذا دفعت الشركة أرباحًا لمساهميها، فكيف يؤثر ذلك على بيان التدفق النقدي؟'],
      option: ['يقل التدفق النقدي من التمويل',
        "يزيد التدفق النقدي من العمليات",
        "يقل التدفق النقدي من الاستثمار"],
      disabled: false,
      questionchecked: [false, false, false],
      cellvalue: ['r22', 'r23', 'r24']
    },
    {
      feedbackvalue: '',
      feedback: ['صحيح! إن دفع الأرباح للمساهمين يقلل من التدفق النقدي من التمويل لأنه يمثل تدفقًا نقديًا خارجيًا.',
        "لا يؤثر دفع الأرباح بشكل مباشر على التدفق النقدي من العمليات، والذي يشمل في المقام الأول النقد الناتج عن الأنشطة التجارية الأساسية للشركة.",
        "لا يؤثر دفع الأرباح بشكل مباشر على التدفق النقدي من الاستثمار، والذي يشمل في المقام الأول التدفقات النقدية المتعلقة بأنشطة الاستثمار مثل شراء أو بيع الأصول."],
      question: ['س6 إذا دفعت الشركة أرباحًا لمساهميها، فكيف يؤثر ذلك على بيان التدفق النقدي؟'],
      option: ['يقل التدفق النقدي من التمويل',
        "يزيد التدفق النقدي من العمليات",
        "يقل التدفق النقدي من الاستثمار"],
      disabled: false,
      questionchecked: [false, false, false],
      cellvalue: ['r22', 'r23', 'r24']
    },
  ];

  constructor() { }
  ngOnInit(): void {
  }

}